#ifndef CINDEXDATASET_H
#define CINDEXDATASET_H

#include <QString>

class cIndexDataSet
{
public:
    //=========================================================================
    // Конструктор
    //=========================================================================
    cIndexDataSet();

    //=========================================================================
    // Атрибуты
    //=========================================================================
    int Index;
    int Object;
    int Subject;
    int Relation;
    QString Date;
    QString Memo;

    //=========================================================================
    // Методы
    //=========================================================================

};//End of class cIndexDataSet

#endif // CINDEXDATASET_H
