#include "cindexdataset.h"

//=========================================================================
// Конструктор
//=========================================================================
cIndexDataSet::cIndexDataSet()
{
    this->Index = 0;
    this->Object = 0;
    this->Relation = 0;
    this->Subject = 0;
    this->Date = "";
    this->Memo = "";
}//End of cIndexDataSet::cIndexDataSet()

//=========================================================================
// Методы
//=========================================================================

